src/Documents/ТабельУчетаРабочегоВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ТабельУчетаРабочегоВремени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РабочееВремяСотрудников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДниРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День6</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День7</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День8</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День9</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День10</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День11</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День12</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День13</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День14</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День15</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День16</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День17</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День18</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День19</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День20</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День21</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День22</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День23</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День24</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День25</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День26</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День27</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День28</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День29</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День30</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>День31</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсегоЧасов</Name>
							<Comment>Всего часов</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ВремяРаботыСотрудниковПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВремяРаботыСотрудниковПлан</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Минуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцОтбор</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/ТабельУчетаРабочегоВремени/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события ПриСозданииНаСервере.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеревоСотрудников.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	
	// Helix = ЗащитаСервер.СоздатьОбъект("Helix");
	Helix.ОбновитьПредставлениеДняВКолонках(Элементы.ДниРаботы, Новый Структура("Месяц", Объект.Период));
	
	// Контроль недавно созданных сотрудников	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(ВернутьТаблицуНовыхСотрудников(), ТаблицаНовыхСотрудников);		
	КонецЕсли;
		
	СтруктураМеню = Новый Структура;
	СтруктураМеню.Вставить("ДниРаботы"	  , "ГруппаДниРаботы");
	СтруктураМеню.Вставить("Дополнительно", "ГруппаДополнительно");
	
	ОбработкаТабличныхЧастейКлиент.СоздатьМенюДокумента(ЭтаФорма, СтруктураМеню, "ГруппаПереключательЗакладок");
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриОткрытии формы.
//
Процедура ПриОткрытии(Отказ)

	Если Объект.Ссылка.Пустая() ИЛИ НЕ ЗначениеЗаполнено(Объект.Период) Тогда
		
		Объект.Период = НачалоМесяца(ОбщегоНазначенияКлиент.ДатаСеанса());	
		ПериодПредставлениеПриИзменении(Неопределено);
		
	КонецЕсли;
	ПериодПредставление = Формат(Объект.Период, "ДФ='MMMM yyyy'"); 
		
	ДеревоСотрудников.Параметры.УстановитьЗначениеПараметра("Период", Объект.Период);
	

	// Контроль недавно созданных сотрудников
	Если ТаблицаНовыхСотрудников.Количество() > 0 Тогда
		 ПодключитьОбработчикОжидания("ДиалогПользователю_ДобавлениеСотрудников", 0.7, Истина);		
	КонецЕсли;	
	
	УстановитьДоступностьВидимостьЭлементов();
	
	Объект.ДниРаботы.Сортировать("Сотрудник");
	
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события ПослеЗаписи.
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбщегоНазначенияКлиентСтоматология.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура - обработчик команды ЗаполнитьПоПлановымЗначениям.
//
Процедура ЗаполнитьПоПлановымЗначениям(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоПлановымЗначениямОтвет", ЭтотОбъект), "При автоматическом заполнении, текущие данные табеля будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет, 15);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик команды ЗаполнитьПоФактическимЗначениям.
//
Процедура ЗаполнитьПоФактическимЗначениям(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоФактическимЗначениямОтвет", ЭтотОбъект), "При автоматическом заполнении, текущие данные табеля будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет, 15);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Заполнить по приемам
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ЗаполнитьПоПриемам(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоПриемамОтвет", ЭтотОбъект), "При автоматическом заполнении, текущие данные табеля будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет, 15);
		
КонецПроцедуры

&НаСервере 
// Процедура - Заполнить по приемам на сервере
//
Процедура ЗаполнитьПоПриемамНаСервере()
	
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВремяРаботыСотрудниковПлан.Сотрудник КАК Ассистент,
	|	Прием.ВремяНачалаПриема КАК ВремяНачалаПриема,
	|	Прием.ВремяОкончанияПриема КАК ВремяОкончанияПриема,
	|	РАЗНОСТЬДАТ(Прием.ВремяНачалаПриема, Прием.ВремяОкончанияПриема, МИНУТА) КАК Минут,
	|	Прием.Сотрудник КАК Врач
	|ИЗ
	|	РегистрСведений.ВремяРаботыСотрудниковПлан КАК ВремяРаботыСотрудниковПлан
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Прием КАК Прием
	|		ПО (ВремяРаботыСотрудниковПлан.Сотрудник = Прием.Ассистент
	|				И Прием.Проведен = ИСТИНА)
	|ГДЕ
	|	Прием.ВремяНачалаПриема МЕЖДУ &ПериодС И &ПериодПо
	|	И ВремяРаботыСотрудниковПлан.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ВремяРаботыСотрудниковПлан.Сотрудник = &Ассистент
	|
	|СГРУППИРОВАТЬ ПО
	|	ВремяРаботыСотрудниковПлан.Сотрудник,
	|	Прием.ВремяНачалаПриема,
	|	Прием.ВремяОкончанияПриема,
	|	Прием.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Прием.Ссылка КАК Ссылка,
	|	Прием.ВремяНачалаПриема КАК ВремяНачалаПриема,
	|	Прием.ВремяОкончанияПриема КАК ВремяОкончанияПриема,
	|	Прием.Ассистент КАК Сотрудник
	|ИЗ
	|	Документ.Прием КАК Прием
	|ГДЕ
	|	Прием.Проведен = ИСТИНА
	|	И Прием.ВремяНачалаПриема МЕЖДУ &ПериодС И &ПериодПо
	|	И Прием.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И Прием.Ассистент = &Ассистент";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Ассистент", Объект.Ассистент);
	Запрос.УстановитьПараметр("ПериодС", НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ПериодПо", КонецМесяца(Объект.Период));
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаАссистирования = Результат[0].Выгрузить();
	ТаблицаАссистирования.Колонки.Добавить("ЧислоПриемовЗаСмену", Новый ОписаниеТипов("Число"));
	ТаблицаАссистирования.Колонки.Добавить("ПризнакОсновной", Новый ОписаниеТипов("Булево"));
	
	ТаблицаПриемов = Результат[1].Выгрузить();
	
	// Высчитываем количество приемов за это время
	Для Каждого СтрокаТЗ Из ТаблицаАссистирования Цикл
		Для Каждого СтрокаТЗПриема Из ТаблицаПриемов Цикл
			Если СтрокаТЗПриема.Сотрудник = СтрокаТЗ.Ассистент И СтрокаТЗПриема.ВремяНачалаПриема >= СтрокаТЗ.ВремяНачалаПриема
					И СтрокаТЗПриема.ВремяНачалаПриема <= СтрокаТЗ.ВремяОкончанияПриема Тогда
				СтрокаТЗ.ЧислоПриемовЗаСмену = СтрокаТЗ.ЧислоПриемовЗаСмену + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	// Удаляем периоды работы, в которые не было приемов, т.е. сотрудник никому не ассистировал
	МассивУдаляемыхСтрок = Новый Массив;
	Для Каждого СтрокаТЗ Из ТаблицаАссистирования Цикл
		Если СтрокаТЗ.ЧислоПриемовЗаСмену = 0 Тогда
			МассивУдаляемыхСтрок.Добавить(СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
	Для Каждого СтрокаТЗ Из МассивУдаляемыхСтрок Цикл
		ТаблицаАссистирования.Удалить(СтрокаТЗ);
	КонецЦикла;	
	
	// Вычисляем ассистирование по совместительству
	ТаблицаАссистирования.Сортировать("ВремяНачалаПриема, ВремяОкончанияПриема, ЧислоПриемовЗаСмену Убыв");
	Для а = 0 По ТаблицаАссистирования.Количество()-1 Цикл
		СтрокаТЗ = ТаблицаАссистирования[а];
		СтрокаТЗ.ПризнакОсновной = Истина;
		Если а > 0 И (СтрокаТЗ.ВремяНачалаПриема >= ТаблицаАссистирования[а-1].ВремяНачалаПриема И СтрокаТЗ.ВремяНачалаПриема <= ТаблицаАссистирования[а-1].ВремяОкончанияПриема
			ИЛИ СтрокаТЗ.ВремяОкончанияПриема >= ТаблицаАссистирования[а-1].ВремяНачалаПриема И СтрокаТЗ.ВремяНачалаПриема <= ТаблицаАссистирования[а-1].ВремяОкончанияПриема
			ИЛИ СтрокаТЗ.ВремяОкончанияПриема < ТаблицаАссистирования[а-1].ВремяНачалаПриема И СтрокаТЗ.ВремяОкончанияПриема > ТаблицаАссистирования[а-1].ВремяОкончанияПриема) Тогда
			СтрокаТЗ.ПризнакОсновной = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	// Переносим в таблицу дней работы
	// Очищаем значение колонок дней
	Для Каждого СтрокаТЗ Из Объект.ДниРаботы Цикл
		Для а = 1 По 31 Цикл
			СтрокаТЗ["День" + а] = Неопределено;
		КонецЦикла;
		СтрокаТЗ.ВсегоЧасов = Неопределено;
		СтрокаТЗ.ВсегоДней = Неопределено;
	КонецЦикла;
	
	// Заполняем табель работы по времени работы сотрудников
	Для Каждого СтрокаРезультат Из ТаблицаАссистирования Цикл
		// МассивСтрокТЗ = Объект.ДниРаботы.НайтиСтроки(Новый Структура("Сотрудник", СтрокаРезультат.Врач));
		МассивСтрокТЗ = Объект.ДниРаботы.НайтиСтроки(Новый Структура("Сотрудник", СтрокаРезультат.Врач));
		Если МассивСтрокТЗ.Количество() > 0 Тогда
			КоличествоМинут = Цел(СтрокаРезультат.Минут / 60) + (СтрокаРезультат.Минут - Цел(СтрокаРезультат.Минут / 60) * 60) / 60;
			МассивСтрокТЗ[0]["День" + День(СтрокаРезультат.ВремяНачалаПриема)] = МассивСтрокТЗ[0]["День" + День(СтрокаРезультат.ВремяНачалаПриема)] + ?(СтрокаРезультат.ПризнакОсновной = Истина, КоличествоМинут, КоличествоМинут / 2);
		КонецЕсли;
	КонецЦикла;
	
	// Пересчитаем итоги в табеле по сотрудникам
	Для Каждого СтрокаТЗ Из Объект.ДниРаботы Цикл
		ПересчитатьИтогиСтрокиДниРаботы(СтрокаТЗ);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура печати документов.
//
Процедура ДокументПечать(Команда)
	
	МассивДокументов = Новый Массив;
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МассивДокументов.Добавить(Объект.Ссылка);
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("ИмяДокумента", "ТабельУчетаРабочегоВремени");
	Структура.Вставить("МассивДокументов", МассивДокументов);
	
	СписокПечатныхФорм = ПолучитьСписокПечати();
	Оповещение = Новый ОписаниеОповещения("ОбработкаКоманды", УправлениеПечатьюКлиентСтоматология, Структура);	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		
		СтруктураВопроса = Новый Структура;
		СтруктураВопроса.Вставить("СписокПечатныхФорм", СписокПечатныхФорм);
		СтруктураВопроса.Вставить("Оповещение", Оповещение);
		ОповещениеДляВопроса = Новый ОписаниеОповещения("ПослеВопросаЗавершение", ЭтотОбъект, СтруктураВопроса);			
		ПоказатьВопрос(ОповещениеДляВопроса, "Данные ещё не записаны. Записать?", РежимДиалогаВопрос.ДаНет);
		
	Иначе	
		
		ПоказатьВыборИзМеню(Оповещение, СписокПечатныхФорм, Элементы.ФормаДокументаПечать);
		
	КонецЕсли;   				
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить всех сотрудников
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьВсехСотрудников(Команда)
	
	ДобавитьСотрудниковНаСервере();
	
КонецПроцедуры

&НаКлиенте
// Процедура - Добавить по группе сотрудников
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьПоГруппеСотрудников(Команда)
	
	ОткрытьФорму("Справочник.Сотрудники.ФормаВыбораГруппы", , ЭтаФорма, , , , Новый ОписаниеОповещения("ДобавитьПоГруппеСотрудниковОтвет", ЭтотОбъект));
	
КонецПроцедуры

// Процедура - Заполнить по фактическим значениям ответ
// Завершение немодального открытия окна "ПоказатьВопрос()"
// Параметры:
//  РезультатВопроса - 	 Ответ на вопрос
//  Параметры	     - 	 Параметры Оповещения 
//
&НаКлиенте
Процедура ДобавитьПоГруппеСотрудниковОтвет(Результат, Параметры)  Экспорт
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьСотрудниковНаСервере(Результат);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Дни работы сотрудник начало выбора
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ДобавитьСотрудника(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметры = Новый Структура();	
	МассивСотрудниковСтруктурнойЕдиницы = МассивРаботниковСтруктурнойЕдиницы(Объект.СтруктурнаяЕдиница);
	
	СтруктураПараметры.Вставить("СписокВыбораСотрудников", МассивСотрудниковСтруктурнойЕдиницы); 
	СтруктураПараметры.Вставить("Заголовок" 			 , "Выберите сотрудника");	   
	СтруктураПараметры.Вставить("БезОтбораПоРолям"		 , Истина);	
	СтруктураПараметры.Вставить("ОтбиратьВрачей"         , Истина);
	
	Оповещение = Новый ОписаниеОповещения("ВыборСотрудникаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Справочник.Сотрудники.Форма.ФормаВыбора" ,СтруктураПараметры,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);			
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Выбор сотрудника завершение.
//
Процедура ВыборСотрудникаЗавершение(ВыбранныйСотрудник, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбранныйСотрудник) Тогда
		
		Строки = Объект.ДниРаботы.НайтиСтроки(Новый Структура("Сотрудник",ВыбранныйСотрудник));
		
		Если Строки.Количество() > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Данный сотрудник уже выбран.",,,,);
		Иначе
			СтрокаТЧ                 =  Объект.ДниРаботы.Добавить();   
			СтрокаТЧ.Сотрудник       = ВыбранныйСотрудник;
			СтрокаТЧ.Должность       = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ВыбранныйСотрудник,"Должность");
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ДниРаботы.
//
Процедура ДниРаботыПриИзменении(Элемент)
	
	Если (Объект.ДниРаботы.Количество()>1) Тогда
		ПересчитатьИтогиСтрокиДниРаботы(Элемент.ТекущиеДанные);
	Конецесли; 
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриАктивизацииСтроки реквизита ДеревоСотрудников.
//
Процедура ДеревоСотрудниковПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ДеревоСотрудников.ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВыделенныйЭлемент = Элементы.ДеревоСотрудников.ТекущиеДанные;	
	
	Если ВыделенныйЭлемент.Свойство("Сотрудник") Тогда
		ЗначениеФильтра = ВыделенныйЭлемент.Сотрудник;
	ИначеЕсли ВыделенныйЭлемент.Свойство("Должность") Тогда	
		ЗначениеФильтра = ВыделенныйЭлемент.Должность;
	Иначе
		ЗначениеФильтра = "ВСЕ";	
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеФильтра) = Тип("СправочникСсылка.Сотрудники") Тогда
		Элементы.ДниРаботы.ОтборСтрок = Новый ФиксированнаяСтруктура("Сотрудник", ЗначениеФильтра);
	ИначеЕсли ТипЗнч(ЗначениеФильтра) = Тип("СправочникСсылка.Должности") Тогда
		Элементы.ДниРаботы.ОтборСтрок = Новый ФиксированнаяСтруктура("Должность", ЗначениеФильтра);		
	Иначе
		// Элементы.ДниРаботы.ОтборСтрок = Неопределено;
		ВызовСервера();
	КонецЕсли;
	ОбработкаТабличныхЧастейКлиент.ОбновитьЗаголовкиТабЧастей(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриИзменении поля ДниРаботыДень.
//
Процедура ДниРаботыДеньПриИзменении(Элемент)
	
	Если ОбщегоНазначенияКлиентСерверСтоматология.Дроб(Число(Элемент.ТекстРедактирования)) >= 0.60 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Количество минут введено не верно!");
		Элементы.ДниРаботы.ТекущиеДанные[Сред(Элемент.Имя, 15)] = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля "Дата".
//
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Дерево сотрудников выбор
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбраннаяСтрока		 - 	 - 
//  Поле				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ДеревоСотрудниковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик события При изменении поля ПериодПредставление
//
Процедура ПериодПредставлениеПриИзменении(Элемент)
	
	Объект.Период = НачалоМесяца(Объект.Период);
	ПериодПредставление = Формат(Объект.Период, "ДФ='MMMM yyyy'");
	
	ДеревоСотрудников.Параметры.УстановитьЗначениеПараметра("Период", Объект.Период);
	
КонецПроцедуры

&НаКлиенте
// Процедура, выполняет обработку нажатия кнопок динамического меню.
//
Процедура ПроцедураОбработкиНажатияМеню(Элемент)
	
	ОбработкаТабличныхЧастейКлиент.ПроцедураОбработкиНажатияМеню(ЭтаФорма, Элемент.Имя);
	
КонецПроцедуры	

&НаКлиенте
// Процедура обработчик события регулирования поля ПериодПредставление
//
Процедура ПериодПредставлениеРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
		Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда
			Объект.Период = ТекущаяДата();
		КонецЕсли;
		
		Объект.Период = ДобавитьМесяц(Объект.Период, Направление);
		ПериодПредставлениеПриИзменении(Элемент);
		
		Модифицированность = Ложь;

КонецПроцедуры

&НаКлиенте
// Процедура обработчик события НачалоВыбора поля ПериодПредставление
//
Процедура ПериодПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущееЗначение = Объект.Период;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПериодПредставлениеПослеВыбора", ЭтотОбъект, Новый Структура("ТекущееЗначение, Элемент", ТекущееЗначение, Элемент));
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", Новый Структура("Значение, РежимВыбораПериода, ЗапрашиватьРежимВыбораПериодаУВладельца", ТекущееЗначение, "Месяц", Ложь), ЭтаФорма,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
// Процедура - Период представление после выбора
//
// Параметры:
//  ВыбранноеЗначение		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПериодПредставлениеПослеВыбора(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	ТекущееЗначение = ДополнительныеПараметры.ТекущееЗначение;
	Элемент = ДополнительныеПараметры.Элемент;
		
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Модифицированность Тогда
		ПериодПредставлениеПослеВыбораЗавершение(Элемент,ВыбранноеЗначение,ТекущееЗначение);
	Иначе
		
		ТекстВопроса = "Изменение периода приведет к очистке таблицы табеля.
		|Вы действительно хотите продолжить?";
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПериодПредставлениеПослеВыбораОтвет", ЭтотОбъект, Новый Структура("ВыбранноеЗначение, ТекущееЗначение, Элемент", ВыбранноеЗначение, ТекущееЗначение, Элемент));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте 
// Процедура - Период представление после выбора завершение
//
// Параметры:
//  РезультатВопроса		 - 	 - 
//  ДополнительныеПараметры	 - 	 - 
//
Процедура ПериодПредставлениеПослеВыбораОтвет(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда	
		ПериодПредставлениеПослеВыбораЗавершение(ДополнительныеПараметры.Элемент,ДополнительныеПараметры.ВыбранноеЗначение,ДополнительныеПараметры.ТекущееЗначение);
	КонецЕсли;
	
КонецПроцедуры
  
&НаКлиенте
// Процедура - Период представление после выбора завершение
//
// Параметры:
//  Элемент				 - 	 - 
//  ВыбранноеЗначение	 - 	 - 
//  ТекущееЗначение		 - 	 - 
//
Процедура ПериодПредставлениеПослеВыбораЗавершение(Элемент,ВыбранноеЗначение,ТекущееЗначение)
	
	Если НачалоМесяца(ТекущееЗначение) <> НачалоМесяца(ВыбранноеЗначение) Тогда
		Объект.Период = КонецДня(ВыбранноеЗначение);
		ПериодПредставлениеПриИзменении(Элемент);
		Модифицированность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - Вид операции при изменении
//
// Параметры:
//  Элемент	 - 	 - 
//
Процедура ВидОперацииПриИзменении(Элемент)
	
	УстановитьДоступностьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

&НаКлиенте
// Процедура - Заполнить по плановым значениям ответ
// Завершение немодального открытия окна "ПоказатьВопрос()"
// Параметры:
//  РезультатВопроса - 	 Ответ на вопрос 
//  Параметры	     - 	 Параметры Оповещения
// 
Процедура ЗаполнитьПоПлановымЗначениямОтвет(РезультатВопроса, Параметры)  Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоРегиструРаботыСотрудников("ВремяРаботыСотрудниковПлан");
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Заполнить по плановым значениям ответ
// Завершение немодального открытия окна "ПоказатьВопрос()"
// Параметры:
//  РезультатВопроса - 	 Ответ на вопрос 
//  Параметры	     - 	 Параметры Оповещения
// 
Процедура ЗаполнитьПоФактическимЗначениямОтвет(РезультатВопроса, Параметры)  Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоРегиструРаботыСотрудников("ВремяРаботыСотрудниковФакт");
	
КонецПроцедуры 

&НаКлиенте
// Процедура - Заполнить по приемам ответ.
//
// Параметры:
//  РезультатВопроса - 	 - 
//  Параметры		 - 	 - 
//
Процедура ЗаполнитьПоприемамОтвет(РезультатВопроса, Параметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоПриемамНаСервере();
	
КонецПроцедуры

&НаСервере
// Процедура очищает и заполняет ТЧ ДниРаботы сотрудниками.
//
Процедура ДобавитьСотрудниковНаСервере(ПоГруппеСотрудников = Неопределено)
	
	Если Не ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница) ИЛИ Не ЗначениеЗаполнено(Объект.Период) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Структурная единица и месяц должны быть заполнены!'; en = 'Structural unit and month must be filled'"));
		Возврат;
	КонецЕсли;
	
	// Заполняем сотрудников
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("ПоГруппеСотрудников", ?(ЗначениеЗаполнено(ПоГруппеСотрудников), ПоГруппеСотрудников, Неопределено));
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.Сотрудник.Должность КАК Должность,	            
	|	НастройкиСотрудников.ДатаУвольнения КАК ДатаУвольнения
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И НастройкиСотрудников.Сотрудник.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА НастройкиСотрудников.ДатаУвольнения > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НастройкиСотрудников.ДатаУвольнения > &Период
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ПоГруппеСотрудников <> НЕОПРЕДЕЛЕНО
	|				ТОГДА НастройкиСотрудников.Сотрудник.Ссылка В ИЕРАРХИИ (&ПоГруппеСотрудников)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиСотрудников.Сотрудник.Наименование";  
	
	РезультатТаблица = Запрос.Выполнить().Выгрузить();
	
	// Заполним значения в совпадающих колонках.
	Для Каждого СтрокаТЗ Из РезультатТаблица Цикл
		Если Объект.ДниРаботы.НайтиСтроки(Новый Структура("Сотрудник", СтрокаТЗ.Сотрудник)).Количество() = 0 Тогда
			НоваяСтрока = Объект.ДниРаботы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ,"Сотрудник, Должность");
		КонецЕсли;
	КонецЦикла;
	
	// Helix = ЗащитаСервер.СоздатьОбъект("Helix");
	Helix.ОбновитьПредставлениеДняВКолонках(Элементы.ДниРаботы, Новый Структура("Месяц", Объект.Период));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Процедура пересчитывает колонки ВсегоЧасов и ВсегоДней в Строке.
//
// ПАРАМЕТРЫ:
//		СтрокаТЧ - СтрокаТабличнойЧасти, в которой необходимо пересчитать итоги
//
Процедура ПересчитатьИтогиСтрокиДниРаботы(СтрокаТЧ)
	
	// ВсегоЧасовЧ = 0;
	// ВсегоЧасовМ = 0;
	// ВсегоДней  = 0;
	//
	// Для а = 1 По 31 Цикл
	//	ЗначениеДня = СтрокаТЧ["День" + а];
	//	ВсегоЧасовЧ = ВсегоЧасовЧ + Цел(ЗначениеДня);
	//	ВсегоЧасовМ = ВсегоЧасовМ + ОбщегоНазначенияКлиентСерверСтоматология.Дроб(ЗначениеДня);
	//	ВсегоДней = ВсегоДней + ?(ЗначениеЗаполнено(ЗначениеДня), 1, 0);
	// КонецЦикла;
	//
	// СтрокаТЧ.ВсегоЧасов = ВсегоЧасовЧ + Цел(ВсегоЧасовМ / 0.60) + ОбщегоНазначенияКлиентСерверСтоматология.Дроб(ВсегоЧасовМ / 0.60) / 100 * 60;
	// СтрокаТЧ.ВсегоДней = ВсегоДней;    
	
	ВсегоЧасов = 0;	
	ВсегоДней  = 0;
	
	Для а = 1 По 31 Цикл
		ЗначениеДня = СтрокаТЧ["День" + а];
		ВсегоЧасов  = ВсегоЧасов + ЗначениеДня;
		ВсегоДней   = ВсегоДней + ?(ЗначениеЗаполнено(ЗначениеДня), 1, 0);
	КонецЦикла;

	СтрокаТЧ.ВсегоЧасов = ВсегоЧасов;
	СтрокаТЧ.ВсегоДней  = ВсегоДней;
	
КонецПроцедуры

&НаСервере
// Процедура - Вызов сервера
//
Процедура ВызовСервера()
	
	Элементы.ДниРаботы.ОтборСтрок = Неопределено;
	
КонецПроцедуры

&НаСервереБезКонтекста  
// Функция, Получить данные даты при изменении.
//
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	РазностьДат = ДвиженияДокументовСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая, ДатаПередИзменением);
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", РазностьДат);
			
	Возврат СтруктураДанные;
	
КонецФункции 

&НаСервере
// Функция - ВернутьТаблицуНовыхСотрудников
//
Функция ВернутьТаблицуНовыхСотрудников()
	
	МассивСотрудников = Объект.ДниРаботы.Выгрузить(, "Сотрудник").ВыгрузитьКолонку("Сотрудник");
	// МассивСотрудников = ТаблицаСотрудников.ВыгрузитьКолонку("Сотрудник");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	               |	НастройкиСотрудников.Сотрудник.Должность КАК Должность
	               |ИЗ
	               |	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	               |ГДЕ
	               |	НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |	И НЕ НастройкиСотрудников.Сотрудник.ПометкаУдаления
	               |	И ВЫБОР
	               |			КОГДА НастройкиСотрудников.ДатаУвольнения > ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				ТОГДА НастройкиСотрудников.ДатаУвольнения > &Период
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И НЕ НастройкиСотрудников.Сотрудник В (&МассивСотрудников)
	               |	И ВЫБОР
	               |			КОГДА НЕ НастройкиСотрудников.ДатаПриема = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |				ТОГДА НАЧАЛОПЕРИОДА(НастройкиСотрудников.ДатаПриема, МЕСЯЦ) <= &Период
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Период", Объект.Период);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
// Обработчик вызова фомы подбора услуг документа аванса
//
Процедура ДиалогПользователю_ДобавлениеСотрудников()
	
	СписокСотрудников = "";
	Для Каждого СтрокаТаблицы Из ТаблицаНовыхСотрудников Цикл 
		СписокСотрудников = СписокСотрудников + Строка(СтрокаТаблицы.Сотрудник);
		СписокСотрудников = СписокСотрудников + Символы.ПС;
	КонецЦикла;	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДиалогПользователю_ДобавлениеСотрудниковЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(ОписаниеОповещения, "Следующие сотрудники были добавлены в базу. Добавить их в табель учета рабочего времени?" + Символы.ПС + Символы.ПС + СписокСотрудников, РежимДиалогаВопрос.ДаНет, , , "Вопрос");		
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогПользователю_ДобавлениеСотрудниковЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОбщегоНазначенияКлиентСерверСтоматология.ЗагрузитьВТаблицуЗначений(ТаблицаНовыхСотрудников, Объект.ДниРаботы);		
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
// Процедура заполняет данными ТЧ ДниРаботы по регистру работы сотрудников
//
// Параметры:
// 		ИмяРегистраВремяРаботыСотрудников  - Строка, имя регистра работы сотрудников
//
Процедура ЗаполнитьПоРегиструРаботыСотрудников(ИмяРегистраВремяРаботыСотрудников)
	
	Запрос       = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
		|	ВремяРаботыСотрудников.Сотрудник,
		|	НАЧАЛОПЕРИОДА(ВремяРаботыСотрудников.ДатаВремяНачала, ДЕНЬ) КАК Дата,
		|	СУММА(ВремяРаботыСотрудников.Минуты) КАК Минуты
		|ИЗ
		|	РегистрСведений." + ИмяРегистраВремяРаботыСотрудников + " КАК ВремяРаботыСотрудников
		|
		|ГДЕ
		|	ВремяРаботыСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И ВремяРаботыСотрудников.ДатаВремяНачала >= &ПериодОт
		|	И ВремяРаботыСотрудников.ДатаВремяНачала <= &ПериодПо
		|
		|СГРУППИРОВАТЬ ПО
		|	ВремяРаботыСотрудников.Сотрудник,
		|	НАЧАЛОПЕРИОДА(ВремяРаботыСотрудников.ДатаВремяНачала, ДЕНЬ)";
		
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Объект.СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ПериодОт"          , НачалоМесяца(Объект.Период));
	Запрос.УстановитьПараметр("ПериодПо"          , КонецМесяца(Объект.Период));

	Результат = Запрос.Выполнить().Выгрузить();
	
	// Очищаем значение колонок дней
	Для Каждого СтрокаТЧ Из Объект.ДниРаботы Цикл
		Для а = 1 По 31 Цикл
			СтрокаТЧ["День" + а] = Неопределено;
		КонецЦикла;
		СтрокаТЧ.ВсегоЧасов = Неопределено;
		СтрокаТЧ.ВсегоДней = Неопределено;
	КонецЦикла;

	// Заполняем табель работы по времени работы сотрудников
	Для Каждого СтрокаРезультат Из Результат Цикл
		СтрокаТЧ = Объект.ДниРаботы.НайтиСтроки(Новый Структура("Сотрудник", СтрокаРезультат.Сотрудник));
		Если СтрокаТЧ.Количество() > 0 Тогда
			СтрокаТЧ[0]["День" + День(СтрокаРезультат.Дата)] = Цел(СтрокаРезультат.Минуты / 60) + (СтрокаРезультат.Минуты - Цел(СтрокаРезультат.Минуты / 60) * 60) / 60;
		КонецЕсли;
	КонецЦикла;
	
	// Пересчитаем итоги в табеле по сотрудникам
	Для Каждого СтрокаТЧ Из Объект.ДниРаботы Цикл
		ПересчитатьИтогиСтрокиДниРаботы(СтрокаТЧ);
	КонецЦикла;	    
		
КонецПроцедуры

&НаКлиенте
// Процедура - Установить доступность видимость элементов
//
Процедура УстановитьДоступностьВидимостьЭлементов()
	
	Элементы.Ассистент.Видимость                     = (Объект.ВидОперации = 1);
	Элементы.ФормаКнопкаЗаполнитьПоПлану.Видимость   = (Объект.ВидОперации = 0);
	Элементы.ФормаКнопкаЗаполнитьПоФакту.Видимость   = (Объект.ВидОперации = 0);
	Элементы.ФормаКнопкаЗаполнитьПоПриемам.Видимость = (Объект.ВидОперации = 1);
	
КонецПроцедуры

&НаКлиенте
// Процедура После вопроса завврешение.
//
Процедура ПослеВопросаЗавершение(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если ПроверитьЗаполнение() = Истина Тогда		
			ЭтаФорма.Записать(Новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));			
		КонецЕсли; 		
		// ПоказатьВыборИзМеню(Параметры.Оповещение, Параметры.СписокПечатныхФорм, Элементы.ФормаДокументаПечать);		
	Иначе
		Возврат;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция Полчить список печатных форм.
//
Функция ПолучитьСписокПечати()
	Возврат Документы.ТабельУчетаРабочегоВремени.ПолучитьСписокПечатныхФорм();	
КонецФункции

&НаСервереБезКонтекста
// Функция - Массив работников структурной единицы
//
// Параметры:
//  СтруктурнаяЕдиница	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция МассивРаботниковСтруктурнойЕдиницы(СтруктурнаяЕдиница)	
	
	Возврат Справочники.СтруктурныеЕдиницы.ПолучитьСотрудниковСтруктурнойЕдиницы(СтруктурнаяЕдиница);
	
КонецФункции 

#КонецОбласти
